lecturenotes/lecture_4/slides_lecture_4.org
#+TITLE: Lecture 4: Alternative Volatility Models
#+AUTHOR: Zheng Tian
#+DATE:
#+STARTUP: beamer
#+OPTIONS: toc:t H:2
#+LATEX_CLASS: beamer
#+LATEX_CLASS_OPTIONS: [presentation,10pt]
#+BEAMER_THEME: CambridgeUS
#+BEAMER_COLOR_THEME: beaver
#+COLUMNS: %45ITEM %10BEAMER_env(Env) %10BEAMER_act(Act) %4BEAMER_col(Col) %8BEAMER_opt(Opt)
#+PROPERTY: BEAMER_col_ALL 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 0.0 :ETC

#+LATEX_HEADER: \usepackage{amsthm}
#+LATEX_HEADER: \usepackage{amsmath}
#+LATEX_HEADER: \usepackage{amssymb}
#+LATEX_HEADER: \usepackage{mathtools}
#+LATEX_HEADER: \newtheorem{mydef}{Definition}
#+LATEX_HEADER: \newtheorem{mythm}{Theorem}
#+LATEX_HEADER: \newcommand{\dx}{\mathrm{d}}
#+LATEX_HEADER: \newcommand{\var}{\mathrm{Var}}
#+LATEX_HEADER: \newcommand{\cov}{\mathrm{Cov}}
#+LATEX_HEADER: \newcommand{\corr}{\mathrm{corr}}
#+LATEX_HEADER: \newcommand{\pr}{\mathrm{Pr}}
#+LATEX_HEADER: \newcommand{\rarrowd}[1]{\xrightarrow{\text{ \textit #1 }}}
#+LATEX_HEADER: \DeclareMathOperator*{\plim}{plim}
#+LATEX_HEADER: \newcommand{\plimn}{\plim_{n \rightarrow \infty}}
#+LATEX_HEADER: \usepackage{booktabs}
#+LATEX_HEADER: \usepackage{color}
#+LATEX_HEADER: \usepackage{caption}
#+LATEX_HEADER: \usepackage{subcaption}
#+LATEX_HEADER: \def\mathbi#1{\textbf{\em #1}}
#+LATEX_HEADER: \setlength{\parskip}{1em}
#+LATEX_HEADER: \newcommand{\undersetdisp}[2]{\underset{\displaystyle #1}{#2}}


* The IGARCH Model

* The GARCH-M Model

* Models with Asymmetry: EGARCH and TGARCH

** EGARCH(m, s): general case

- EGARCH(m, s)

  \begin{align*}
  a_t &= \sigma_t \epsilon_t,\; \epsilon_t \sim i.i.d.(0, 1) \\
  \ln(\sigma^2_t)&= \alpha_0 + \frac{1 + \beta_1 B + \cdots + \beta_{s-1} B^{s-1}}{1 - \alpha_1 B - \cdots - \alpha_m B^m} g(\epsilon_{t-1})
  \end{align*}

- Asymmetry via $g(\epsilon_t)$

  \begin{align*}
  g(\epsilon_t) &= \theta \epsilon_t + \gamma \left[ \left| \epsilon_t \right| - E \left( |\epsilon_t| \right)  \right] \\
  &=
  \begin{cases}
  (\theta + \gamma)\epsilon_t - \gamma E(|\epsilon_t|), \text{ when } \epsilon_t \geq 0  \\
  (\theta - \gamma)\epsilon_t - \gamma E(|\epsilon_t|), \text{ when } \epsilon_t < 0
  \end{cases}
  \end{align*}

** Example: EGARCH(1, 1)
:PROPERTIES:
:BEAMER_opt: shrink
:END:

- EGARCH(1, 1)
  \begin{align*}
  a_t &= \sigma_t \epsilon_t,\; \epsilon_t \sim i.i.d. N(0, 1) \text{ and } E(|\epsilon_t|) = \sqrt{2/\pi} \\ \\
  \ln(\sigma^2_t)&= \alpha_0 + \frac{1}{1 - \alpha B} g(\epsilon_{t-1}) \\
  g(\epsilon_t) &= \theta \epsilon_t + \gamma \left( |\epsilon_t| - \sqrt{2/\pi} \right)
  \end{align*}

- Derive $\sigma^2_t$
  \begin{equation*}
  (1 - \alpha B) \ln(\sigma^2_t) = 
  \begin{cases}
  \alpha^{*} + (\theta + \gamma) \epsilon_{t-1},\; \text{ when } \epsilon_{t-1} \geq 0 \\
  \alpha^{*} + (\theta - \gamma) \epsilon_{t-1},\; \text{ when } \epsilon_{t-1} < 0
  \end{cases}
  \end{equation*}
  where $\alpha^{*} = \alpha_0(1 - \alpha) - \gamma
  \sqrt{2/\pi}$. Therefore, 
  \begin{equation*}
  \sigma^2_t = \sigma^2_{t-1} \exp(\alpha^{*}) 
  \begin{cases}
  \exp \left( (\gamma+\theta) \frac{a_{t-1}}{\sigma_{t-1}} \right) \\
  \exp \left( (\gamma-\theta) \frac{|a_{t-1}|}{\sigma_{t-1}} \right)
  \end{cases}
  \end{equation*}
 
* The CHARMA model

** What is a CHARMA model?

- CHARMA: Conditional heteroskedasticity ARMA model (Tsay, 1987)

\vspace{0.05cm}

- A general CHARMA model
  \begin{align*}
  r_t &= \mu_t + a_t \\
  a_t &= \delta_{1t} a_{t-1} + \delta_{25} a_{t-2} + 
         \cdots + \delta_{mt} a_{t-m} + \eta_t
  \end{align*}

- Gaussian white noise: $\eta_t \sim i.i.d. N(0, \sigma^2_{\eta})$

\vspace{0.05cm}

- Random coefficient: $\boldsymbol{\delta}_t = (\delta_{1t},
  \delta_{2t}, \ldots, \delta_{mt})^{\prime}$.

\vspace{0.05cm}

- Let $\mathrm{a}_{t-1} = (a_{t-1}, \ldots, a_{t-m})$. Then CHARMA
  model is rewritten as 
  \[ a_t = \mathrm{a}_{t-1}^{\prime} \boldsymbol{\delta}_t + \eta_t \]

** Random coefficients

- $\{\boldsymbol{\delta}_t\} = \{(\delta_{1t}, \delta_{2t}, \ldots,
  \delta_{mt})^{\prime}\}$ is a sequence of i.i.d. random vectors.

\vspace{0.1cm}

- $\{\boldsymbol{\delta}_t\}$ is independent of $\{\eta_t\}$. 

\vspace{0.1cm}

- $E(\boldsymbol{\delta}_t) = \mathbf{0}$ and $E(\boldsymbol{\delta}_t
  \boldsymbol{\delta}_t^{\prime}) = \boldsymbol{\Omega}$.
  \begin{equation*}
  \boldsymbol{\Omega} = 
  \begin{pmatrix}
  \omega_{11} & \omega_{12} & \cdots & \omega_{1m} \\
  \omega_{21} & \omega_{22} & \cdots & \omega_{2m} \\
  \vdots      & \vdots      & \ddots & \vdots \\
  \omega_{m1} & \omega_{m2} & \cdots & \omega_{mm} \\
    \end{pmatrix}
  \end{equation*}

** Conditional variance of $a_t$ in CHARMA

- The conditional variance of $a_t$, i.e. $\var_{t-1}(a_t) = \sigma^2_t$:
  \begin{equation*}
  \begin{split}
    \sigma^2_t &= \sigma^2_{\eta} + \mathbf{a}_{t-1}^{\prime} \boldsymbol{\Omega} \mathbf{a}_{t-1} \\
               &= \sigma^2_{\eta} + (a_{t-1}, \ldots, a_{t-m})\boldsymbol{\Omega} (a_{t-1}, \ldots, a_{t-m})^{\prime}
  \end{split}
  \end{equation*}

\vspace{0.1cm}

- Since $\boldsymbol{\Omega}$ is positive semi-definite, $\sigma^2_t
  \geq \sigma^2_{\eta} > 0$ is always true. 

\vspace{0.1cm}

- The conditional variance is similar to ARCH but with difference.

  - When $m = 1$, $\sigma^2_t = \sigma^2_{\eta} + \omega_{11} a_{t-1}^2$.

  - When $m =2$, $\sigma^2_t = \sigma^2_{\eta} + \omega_{11} a_{t-1}^2 +
    \underbrace{2\omega_{12} a_{t-1} a_{t-2}}_{\text{cross-product term}} + \omega_{22} a^2_{t-2}$.

** Problem of CHARMA

- The number of cross-product terms increases with the order of $m$.

\vspace{0.1cm}

- The higher-order properties are hard to derive.

* Random Coefficient Autoregressive Model (RCA)

** Why use random coefficient autoregressive model?

- Random coefficient: account for variability among different subjects.
  - Panel data; hierarchical models

\vspace{0.2cm}

- Time series model: the coefficients in the mean equation evolve over time.

** RCA(p)

- The mean equation
     
  \begin{equation*}
  r_t = \phi_0 + \sum_{i=1}^p (\phi_i + \delta_{it}) r_{t-i} + a_t
  \end{equation*}

- Random coefficients
  
  \[\{\boldsymbol{\delta}_t\} = \{(\delta_{1t}, \delta_{2t}, \ldots,
  \delta_{pt})^{\prime}\}\]

  - Independent series;
  - $E(\boldsymbol{\delta}_t) = \mathbf{0}$ and
    $\var{\boldsymbol{\delta}_t} = \boldsymbol{\Omega}_{\delta}$;
  - $\{\boldsymbol{\delta}_t\}$ is independent of $\{\mathbf{a}_t\}$

** Conditional mean and variance

- The conditional mean

  \[\mu_t = E_{t-1}(r_t) = \phi_0 + \sum_{i=1}^p \phi_i r_{t-i} \]

- The conditional variance

  \begin{equation*}
  \begin{split}
  \sigma^2_t &= E_{t-1} \left((r_t - \mu_t)^2 \right) = E_{t-1} \left((\mathbf{r}_{t-1})^{\prime} \boldsymbol{\delta}_t + a_t)^2 \right) \\
  &= \sigma^2_a + (r_{t-1}, \ldots, r_{t-p}) \boldsymbol{\Omega}_{\delta} (r_{t-1}, \ldots, r_{t-p})^{\prime}
  \end{split}
  \end{equation*}

- Similar to CHARMA but with the quadratic function of $r_{t-i}$. 

  
